// applay concut 
const array1 = [50, 60, 70, 80, 90]
const array2 = [100, 150, 170, 290]
const array3 = array1.concat(array2)
console.log(array3)
// ans:[50, 60, 70, 80, 90, 100, 150, 170, 290]
///////////////////////////////////////////////////
//applay slice
const sliceArray = [100, 200, 300, 400, 500, 600, 700]
console.log(sliceArray.slice(3, 6))//index ৩ আগ থেকে ৬ এর আগ পযন্ত slice করা হয়েছে।
console.log(sliceArray)
//ans:[400, 500, 600]
//ans:[100, 200, 300, 400, 500, 600, 700]
// এখানে array এর কোন পরিবর্তন গটে না
/////////////////////////////////////////////////////
// ‍applay splice
const spliceArray = [50, 100, 200, 300, 400, 500, 600]
console.log(spliceArray.splice(2, 3, 1, 5, 7))//splice(প্রথস টি কোথায় থেকে সুরু ২য় টি কত গুলো, এর পরের গুলো নতুন উপাদান)
console.log(spliceArray)
//ans:[200, 300, 400]
//ans:[50, 100, 1, 5, 7, 500, 600]
//একটি অ্যারে থেকে উপাদানগুলি সরিয়ে দেয় এবং,
// যদি প্রয়োজন হয়, তাদের জায়গায় নতুন উপাদান সন্নিবেশ করায়,
// মুছে ফেলা উপাদানগুলি ফিরিয়ে দেয়।